In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel('data/file_1806.xlsx')

df

         決算日    科目コード    金額
0 2018-06-30  10001.0  10.0
1 2018-06-30      NaN  20.0
2 2018-06-30  10003.0   NaN
3 2018-06-30  10002.0  40.0
4 2018-06-30  10001.0  50.0

# 欠損値をNoneに変換

In [3]:
df1 = df.where(df.notnull(), None)

df1

         決算日  科目コード    金額
0 2018-06-30  10001    10
1 2018-06-30   None    20
2 2018-06-30  10003  None
3 2018-06-30  10002    40
4 2018-06-30  10001    50